# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд], потім перемножити цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.

numbers = [1, 0, 2, 0, 4, 0, 1, 6, 9]

my_sum = 0

# сумма четных чисел
for number in numbers:
    if number % 2 == 0:
        my_sum += number

print(my_sum)

# сумма чисел по четным индексам
my_sum = 0

# сумма четных чисел
for index in range(len(numbers)):
    if index % 2 == 0:
        my_sum += numbers[index]

print(my_sum)
